Ran Plan for dir: `projects/dev` workspace: `default`

<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.argocd.data.kubernetes_secret.argocd_initial_password will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "kubernetes_secret" "argocd_initial_password" {
      + data      = (sensitive value)
      + id        = (known after apply)
      + immutable = (known after apply)
      + type      = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "argocd-initial-admin-secret"
          + namespace        = "argocd"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.cloudflare.cloudflare_dns_record.istio-gateway will be updated in-place
~ resource "cloudflare_dns_record" "istio-gateway" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ content             = "34.47.92.167" -> (known after apply)
      ~ created_on          = "2025-01-28T12:03:24Z" -> (known after apply)
      + data                = (known after apply)
        id                  = "5b3805bf479bd12a29aad2877a6cfdfa"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-01-28T12:03:24Z" -> (known after apply)
        name                = "*.goboolean.io"
      ~ proxiable           = true -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.harbor.harbor_garbage_collection.gc-schedule will be created
+ resource "harbor_garbage_collection" "gc-schedule" {
      + id       = (known after apply)
      + schedule = "Daily"
      + workers  = 1
    }

  # module.harbor.harbor_project.fetch-system will be created
+ resource "harbor_project" "fetch-system" {
      + auto_sbom_generation        = false
      + enable_content_trust        = false
      + enable_content_trust_cosign = false
      + force_destroy               = false
      + id                          = (known after apply)
      + name                        = "fetch-system"
      + project_id                  = (known after apply)
      + public                      = true
      + registry_id                 = (known after apply)
      + storage_quota               = -1
      + vulnerability_scanning      = true
    }

  # module.harbor.harbor_retention_policy.fetch-system-retention will be created
+ resource "harbor_retention_policy" "fetch-system-retention" {
      + id       = (known after apply)
      + schedule = "Daily"
      + scope    = (known after apply)

      + rule {
          + disabled             = false
          + most_recently_pushed = 2
          + repo_matching        = "**"
          + untagged_artifacts   = true
        }
    }

  # module.harbor.helm_release.harbor will be created
+ resource "helm_release" "harbor" {
      + atomic                     = false
      + chart                      = "harbor"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "harbor"
      + namespace                  = "harbor"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://helm.goharbor.io"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + (sensitive value),
        ]
      + verify                     = false
      + version                    = "1.15.1"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.harbor.kubernetes_manifest.harbor_gateway will be created
+ resource "kubernetes_manifest" "harbor_gateway" {
      + manifest = {
          + apiVersion = "networking.istio.io/v1beta1"
          + kind       = "VirtualService"
          + metadata   = {
              + name      = "harbor-vs"
              + namespace = "harbor"
            }
          + spec       = {
              + gateways = [
                  + "istio-system/istio-ingressgateway",
                ]
              + hosts    = [
                  + "registry.goboolean.io",
                ]
              + http     = [
                  + {
                      + route = [
                          + {
                              + destination = {
                                  + host = "harbor.harbor.svc.cluster.local"
                                  + port = {
                                      + number = 80
                                    }
                                }
                            },
                        ]
                    },
                ]
            }
        }
      + object   = {
          + apiVersion = "networking.istio.io/v1beta1"
          + kind       = "VirtualService"
          + metadata   = {
              + annotations                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "harbor-vs"
              + namespace                  = "harbor"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + spec       = {
              + exportTo = (known after apply)
              + gateways = [
                  + "istio-system/istio-ingressgateway",
                ]
              + hosts    = [
                  + "registry.goboolean.io",
                ]
              + http     = [
                  + {
                      + corsPolicy       = {
                          + allowCredentials    = (known after apply)
                          + allowHeaders        = (known after apply)
                          + allowMethods        = (known after apply)
                          + allowOrigin         = (known after apply)
                          + allowOrigins        = (known after apply)
                          + exposeHeaders       = (known after apply)
                          + maxAge              = (known after apply)
                          + unmatchedPreflights = (known after apply)
                        }
                      + delegate         = {
                          + name      = (known after apply)
                          + namespace = (known after apply)
                        }
                      + directResponse   = {
                          + body   = {
                              + bytes  = (known after apply)
                              + string = (known after apply)
                            }
                          + status = (known after apply)
                        }
                      + fault            = {
                          + abort = {
                              + grpcStatus = (known after apply)
                              + http2Error = (known after apply)
                              + httpStatus = (known after apply)
                              + percentage = {
                                  + value = (known after apply)
                                }
                            }
                          + delay = {
                              + exponentialDelay = (known after apply)
                              + fixedDelay       = (known after apply)
                              + percent          = (known after apply)
                              + percentage       = {
                                  + value = (known after apply)
                                }
                            }
                        }
                      + headers          = {
                          + request  = {
                              + add    = (known after apply)
                              + remove = (known after apply)
                              + set    = (known after apply)
                            }
                          + response = {
                              + add    = (known after apply)
                              + remove = (known after apply)
                              + set    = (known after apply)
                            }
                        }
                      + match            = (known after apply)
                      + mirror           = {
                          + host   = (known after apply)
                          + port   = {
                              + number = (known after apply)
                            }
                          + subset = (known after apply)
                        }
                      + mirrorPercent    = (known after apply)
                      + mirrorPercentage = {
                          + value = (known after apply)
                        }
                      + mirror_percent   = (known after apply)
                      + mirrors          = (known after apply)
                      + name             = (known after apply)
                      + redirect         = {
                          + authority    = (known after apply)
                          + derivePort   = (known after apply)
                          + port         = (known after apply)
                          + redirectCode = (known after apply)
                          + scheme       = (known after apply)
                          + uri          = (known after apply)
                        }
                      + retries          = {
                          + attempts              = (known after apply)
                          + perTryTimeout         = (known after apply)
                          + retryOn               = (known after apply)
                          + retryRemoteLocalities = (known after apply)
                        }
                      + rewrite          = {
                          + authority       = (known after apply)
                          + uri             = (known after apply)
                          + uriRegexRewrite = {
                              + match   = (known after apply)
                              + rewrite = (known after apply)
                            }
                        }
                      + route            = [
                          + {
                              + destination = {
                                  + host   = "harbor.harbor.svc.cluster.local"
                                  + port   = {
                                      + number = 80
                                    }
                                  + subset = (known after apply)
                                }
                              + headers     = {
                                  + request  = {
                                      + add    = (known after apply)
                                      + remove = (known after apply)
                                      + set    = (known after apply)
                                    }
                                  + response = {
                                      + add    = (known after apply)
                                      + remove = (known after apply)
                                      + set    = (known after apply)
                                    }
                                }
                              + weight      = (known after apply)
                            },
                        ]
                      + timeout          = (known after apply)
                    },
                ]
              + tcp      = (known after apply)
              + tls      = (known after apply)
            }
        }
    }

  # module.istio.data.kubernetes_service.istio_ingressgateway will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "kubernetes_service" "istio_ingressgateway" {
      + id     = (known after apply)
      + spec   = (known after apply)
      + status = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "istio-ingressgateway"
          + namespace        = "istio-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.namespace.kubernetes_namespace.harbor will be created
+ resource "kubernetes_namespace" "harbor" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "name" = "harbor"
            }
          + name             = "harbor"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 6 to add, 1 to change, 0 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d projects/dev`
* :put_litter_in_its_place: To **delete** this plan click [here](http://34.64.35.124/lock?id=goboolean%252Finfrastructure%252Fprojects%252Fdev%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d projects/dev`
</details>
Plan: 6 to add, 1 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
